{
  "format": "layers-model",
  "generatedBy": "keras v3.8.0",
  "convertedBy": "TensorFlow.js Converter v4.22.0",
  "modelTopology": {
    "model_config": {
      "class_name": "Sequential",
      "config": {
        "name": "sequential",
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [null, 150, 150, 3],
              "dtype": "float32",
              "name": "input_layer"
            }
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d",
              "filters": 32,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "valid",
              "activation": "relu"
            }
          },
          {
            "class_name": "MaxPooling2D",
            "config": {
              "name": "max_pooling2d",
              "pool_size": [2, 2],
              "strides": [2, 2],
              "padding": "valid"
            }
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_1",
              "filters": 64,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "valid",
              "activation": "relu"
            }
          },
          {
            "class_name": "MaxPooling2D",
            "config": {
              "name": "max_pooling2d_1",
              "pool_size": [2, 2],
              "strides": [2, 2],
              "padding": "valid"
            }
          },
          {
            "class_name": "Flatten",
            "config": {
              "name": "flatten"
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense",
              "units": 128,
              "activation": "relu"
            }
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "dropout",
              "rate": 0.5
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_1",
              "units": 3,
              "activation": "softmax"
            }
          }
        ]
      }
    },
    "training_config": {
      "loss": "categorical_crossentropy",
      "metrics": ["accuracy"],
      "optimizer_config": {
        "class_name": "RMSprop",
        "config": {
          "learning_rate": 0.001,
          "rho": 0.9,
          "momentum": 0.0,
          "epsilon": 1e-07,
          "centered": false
        }
      }
    }
  },
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1of11.bin",
        "group1-shard2of11.bin",
        "group1-shard3of11.bin",
        "group1-shard4of11.bin",
        "group1-shard5of11.bin",
        "group1-shard6of11.bin",
        "group1-shard7of11.bin",
        "group1-shard8of11.bin",
        "group1-shard9of11.bin",
        "group1-shard10of11.bin",
        "group1-shard11of11.bin"
      ],
      "weights": [
        { "name": "conv2d/kernel", "shape": [3, 3, 3, 32], "dtype": "float32" },
        { "name": "conv2d/bias", "shape": [32], "dtype": "float32" },
        { "name": "conv2d_1/kernel", "shape": [3, 3, 32, 64], "dtype": "float32" },
        { "name": "conv2d_1/bias", "shape": [64], "dtype": "float32" },
        { "name": "dense/kernel", "shape": [82944, 128], "dtype": "float32" },
        { "name": "dense/bias", "shape": [128], "dtype": "float32" },
        { "name": "dense_1/kernel", "shape": [128, 3], "dtype": "float32" },
        { "name": "dense_1/bias", "shape": [3], "dtype": "float32" }
      ]
    }
  ]
}
